// задача 22
Console.WriteLine("!");
int num= 
for (int  i = 0;  i < nun;  i++)
{
    Console.WriteLine(${Res:f2"!");    
    
}
int ya = Convert.ToInt32(Con)

Console.WriteLine("введ")// 24 ЗАДАЧА С семин 4
int A = 
int sum = 
for (int i = 0; i < length; i++)
{
    sum =
    
}
Console.WriteLine("Сумма чисел от 1 до А")

//зад 26 вход - число выход кол чисел 456 - 3 
Console.WriteLine("введите число");// максим
int A = Convert.ToInt32(Console.ReadLine());
int i = 0
for(i = 0; i <=A; i++);
{
    A=A

}
Console.WriteLine("")

Console.WriteLine("введите число");// максим Задача 26: Напишите программу, которая принимает на вход число и выдаёт
//  количество цифр в числе.
int A = Convert.ToInt32(Console.ReadLine());
int i = 0
for(i = 0; i <=A; i++);
{
    A=A
}
Console.WriteLine("")

Console.WriteLine("введите число");// олег 26 
int num = Convert.ToInt32(Console.ReadLine());
int i = 0;
while(num > 10)
{
   num = num/10;
   i+=1;
}
Console.WriteLine("i")

Console.WriteLine("введите число");// иван 26
int A = Convert.ToInt32(Console.ReadLine());// а число i счет 
int i = 0;
while (A > 0);{//ПРАВИЛЬНЕЕ
    A/=10;
    i++;
}

// for (i = 0; A > 10; i++)
// {
//    A/=10;
//    }
Console.WriteLine("i");




int A = 
int sum = 
for (int i = 0; i < length; i++)
{
    sum =
    
}
Console.WriteLine("Сумма чисел от 1 до А")

//зад 11 сем 2 выводит случ. трехзн число и удаляет втор
int number = new Random().Next(100,1000);
Console.WriteLine($"Случайное число {number}");
int number1 = number%10;
int number2 = number/100;
Console.WriteLine($"результат выполнения равен{number2*10+number1}");

